🚀&nbsp; env0 had composed a PR Plan for environment [My First Project / staging ](https://app.env0.com/p/f249f379-6361-4103-834b-c4232af1a899/environments/9696f998-131b-48ce-aad8-772e82dfab39):
```
Plan: 1 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:


  # cloudamqp_instance.instance will be created
+   resource "cloudamqp_instance" "instance" {
+       apikey              = (sensitive value)
+       dedicated           = (known after apply)
+       host                = (known after apply)
+       host_internal       = (known after apply)
+       id                  = (known after apply)
+       keep_associated_vpc = false
+       name                = "pdf-rabbitmq-test"
+       no_default_alarms   = (known after apply)
+       nodes               = (known after apply)
+       plan                = "lemur"
+       ready               = (known after apply)
+       region              = "amazon-web-services::us-east-1"
+       rmq_version         = (known after apply)
+       tags                = [
+           "terraform",
        ]
+       url                 = (sensitive value)
+       vhost               = (known after apply)
+       vpc_id              = (known after apply)
+       vpc_subnet          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>


```
There are no cost estimation changes
```

[Full PR Plan logs on env0](https://app.env0.com/p/f249f379-6361-4103-834b-c4232af1a899/environments/9696f998-131b-48ce-aad8-772e82dfab39/deployments/1c1d1eca-ed9d-4400-ae12-bdf2b339dc88)